<a href="https://colab.research.google.com/github/Fuenfgeld/DatamanagementAndArchiving/blob/main/PandasTutorial/PandasL%C3%B6sungen.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# import packages
import pandas as pd
import numpy as np

In [ ]:
from numpy.random import randn
np.random.seed(101)

#Exercise1



Consider the following Python dictionary data and Python list labels:

In [ ]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

1. Create a DataFrame df from this dictionary data which has the index labels.

In [ ]:
df = pd.DataFrame(data=data, index=labels)

In [ ]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [ ]:
df.head()

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no

2. Display a summary of the basic information about this DataFrame and its data

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [ ]:
df.shape

(10, 4)

In [ ]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

In [ ]:
df.columns

Index(['animal', 'age', 'visits', 'priority'], dtype='object')

3. Return the first 3 rows of the DataFrame df.

In [ ]:
df.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

4.Select just the 'animal' and 'age' columns from the DataFrame df.

In [ ]:
df[["age", "animal"]]

   age animal
a  2.5    cat
b  3.0    cat
c  0.5  snake
d  NaN    dog
e  5.0    dog
f  2.0    cat
g  4.5  snake
h  NaN    cat
i  7.0    dog
j  3.0    dog

5.Select the rows where the age is missing, i.e. it is NaN.

In [ ]:
df[df.age.isna()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

6.Select the rows where the animal is a cat and the age is less than 3.

In [ ]:
df[(df.animal=='cat') & (df.age<3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

7.Select the rows the age is between 2 and 4 (inclusive).

In [ ]:
df[df.age.between(2, 4, inclusive=True)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

In [ ]:
df[(df.age>=2) & (df.age<=4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

8.Calculate the mean age for each different animal in df.

In [ ]:
df.groupby(["animal"])["age"].mean()

animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64

9. Count the number of each type of animal in df.

In [ ]:
df.groupby(["animal"]).size()

animal
cat      4
dog      4
snake    2
dtype: int64

10. For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).

In [ ]:
pd.pivot_table(df, index='animal', columns=['visits'], values='age', aggfunc='mean')

visits    1    2    3
animal
cat     2.5  NaN  2.5
dog     3.0  6.0  NaN
snake   4.5  0.5  NaN

In [ ]:
# pd.pivot_table(df, index='animal', values=['visits', "age"], aggfunc={'visits':'sum', 'age':'mean'})

# Exercise 2



Consider the following dataframe:

In [ ]:
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
student_data

   school_code class            name  ... height  weight  address
S1        s001     V  Alberto Franco  ...    173      35  street1
S2        s002     V    Gino Mcneill  ...    192      32  street2
S3        s003    VI     Ryan Parkes  ...    186      33  street3
S4        s001    VI    Eesha Hinton  ...    167      30  street1
S5        s002     V    Gino Mcneill  ...    151      31  street2
S6        s004    VI    David Parkes  ...    159      32  street4

[6 rows x 8 columns]

1. Write a Pandas program to split the following dataframe by school code and get mean, min, and max value of age for each school.

In [ ]:
student_data.groupby(["school_code"])["school_code", "age"].mean()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

              age
school_code
s001         12.5
s002         13.0
s003         13.0
s004         12.0

In [ ]:
student_data.groupby(["school_code"], as_index=False)["school_code", "age"].min()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

  school_code  age
0        s001   12
1        s002   12
2        s003   13
3        s004   12

In [ ]:
student_data.groupby(["school_code"], as_index=False)["school_code", "age"].max()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

  school_code  age
0        s001   13
1        s002   14
2        s003   13
3        s004   12

2.Write a Pandas program to split the following given dataframe into groups based on school code and class.

In [ ]:
student_data.groupby(["school_code", "class"]).apply(lambda a: a[:])

                     school_code class            name  ... height  weight  address
school_code class                                       ...
s001        V     S1        s001     V  Alberto Franco  ...    173      35  street1
            VI    S4        s001    VI    Eesha Hinton  ...    167      30  street1
s002        V     S2        s002     V    Gino Mcneill  ...    192      32  street2
                  S5        s002     V    Gino Mcneill  ...    151      31  street2
s003        VI    S3        s003    VI     Ryan Parkes  ...    186      33  street3
s004        VI    S6        s004    VI    David Parkes  ...    159      32  street4

[6 rows x 8 columns]

# Exercise 3

Consider the following dataframes:

In [ ]:
df_employees_sal = pd.DataFrame({
    'year':[1980,1981,1980,1981,1980,1981,1980,1981],
    'id':[1,1,2,2,3,3,4,4],
    'name':['alice','alice','bob','bob','charlie','charlie','david','david'],
    'salary':[30000,30000,40000,41000,35000,40000,45000,45000],
    'company_id':[1,1,2,2,1,1,2,2]})

df_companies_rev = pd.DataFrame({
    'year':[1980,1981,1980,1981],
    'id':[1,1,2,2],
    'name':['bell labs','bell labs','xerox','xerox'],
    'revenue':[1130000,1130000,5000000,500000]})

In [ ]:
print("DataFrames1:")
print(df_employees_sal)
print("--------------------")
print("DataFrame2")
print(df_companies_rev)

DataFrames1:
   year  id     name  salary  company_id
0  1980   1    alice   30000           1
1  1981   1    alice   30000           1
2  1980   2      bob   40000           2
3  1981   2      bob   41000           2
4  1980   3  charlie   35000           1
5  1981   3  charlie   40000           1
6  1980   4    david   45000           2
7  1981   4    david   45000           2
--------------------
DataFrame2
   year  id       name  revenue
0  1980   1  bell labs  1130000
1  1981   1  bell labs  1130000
2  1980   2      xerox  5000000
3  1981   2      xerox   500000

1.   Write a Pandas program to calculate total salary for each person.

In [ ]:
df_employees_sal.groupby("name", as_index=False)["name", "salary"].sum()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

      name  salary
0    alice   60000
1      bob   81000
2  charlie   75000
3    david   90000

2. Write a Pandas program to add a new column to frist datafram and show name of company that of work for each person.

In [ ]:
# df_employees_sal.reset_index(inplace=True)
df_employees_sal

   year  id     name  salary  company_id
0  1980   1    alice   30000           1
1  1981   1    alice   30000           1
2  1980   2      bob   40000           2
3  1981   2      bob   41000           2
4  1980   3  charlie   35000           1
5  1981   3  charlie   40000           1
6  1980   4    david   45000           2
7  1981   4    david   45000           2

In [ ]:
# df_companies_rev.reset_index(inplace=True)
df_companies_rev

   year  id       name  revenue
0  1980   1  bell labs  1130000
1  1981   1  bell labs  1130000
2  1980   2      xerox  5000000
3  1981   2      xerox   500000

In [ ]:

df = pd.merge(df_employees_sal, df_companies_rev[["id", "name"]], how="left", left_on="company_id", right_on="id", left_index=True, right_index=True)
df

   year  id_x   name_x  salary  company_id  id_y     name_y
0  1980     1    alice   30000           1   1.0  bell labs
1  1981     1    alice   30000           1   1.0  bell labs
2  1980     2      bob   40000           2   2.0      xerox
3  1981     2      bob   41000           2   2.0      xerox
4  1980     3  charlie   35000           1   NaN        NaN
5  1981     3  charlie   40000           1   NaN        NaN
6  1980     4    david   45000           2   NaN        NaN
7  1981     4    david   45000           2   NaN        NaN

In [ ]:

df = pd.merge(df_employees_sal, df_companies_rev[["id", "name"]], how="left", left_on="company_id", right_on="id", left_index=False, right_index=False)
df.drop_duplicates(inplace=True)
df

    year  id_x   name_x  salary  company_id  id_y     name_y
0   1980     1    alice   30000           1     1  bell labs
2   1981     1    alice   30000           1     1  bell labs
4   1980     2      bob   40000           2     2      xerox
6   1981     2      bob   41000           2     2      xerox
8   1980     3  charlie   35000           1     1  bell labs
10  1981     3  charlie   40000           1     1  bell labs
12  1980     4    david   45000           2     2      xerox
14  1981     4    david   45000           2     2      xerox

# Exercise 4

Consider the following dataset:

In [ ]:
from sklearn import datasets
# Load the diabetes dataset
diabetes_X, diabetes_y = datasets.load_diabetes(return_X_y=True)

In [ ]:
type(diabetes_X)

numpy.ndarray

Create a regression model. Solution should be includes:


* spliting data to train and test set,
* training the model
* perdiction 
* saving the model as a pickle file
* exporting results as an excel file

In [ ]:
X = pd.DataFrame(diabetes_X)
X.head()

          0         1         2  ...         7         8         9
0  0.038076  0.050680  0.061696  ... -0.002592  0.019908 -0.017646
1 -0.001882 -0.044642 -0.051474  ... -0.039493 -0.068330 -0.092204
2  0.085299  0.050680  0.044451  ... -0.002592  0.002864 -0.025930
3 -0.089063 -0.044642 -0.011595  ...  0.034309  0.022692 -0.009362
4  0.005383 -0.044642 -0.036385  ... -0.002592 -0.031991 -0.046641

[5 rows x 10 columns]

In [ ]:
X.shape

(442, 10)

In [ ]:
y = pd.DataFrame(diabetes_y)
y.head()

       0
0  151.0
1   75.0
2  141.0
3  206.0
4  135.0

In [ ]:
y.shape

(442, 1)

In [ ]:
y.rename(columns={0:"label"}, inplace=True)
y.head()

   label
0  151.0
1   75.0
2  141.0
3  206.0
4  135.0

In [ ]:
df = pd.concat([X, y], axis=1)
df.shape

(442, 11)

In [ ]:
# shuffle
df.sample(frac=1)

            0         1         2  ...         8         9  label
12   0.016281 -0.044642 -0.028840  ... -0.030751 -0.042499  179.0
19  -0.027310 -0.044642 -0.018062  ... -0.008944 -0.054925  168.0
139  0.023546 -0.044642  0.061696  ...  0.054724 -0.005220  281.0
143 -0.030942 -0.044642  0.005650  ... -0.041180 -0.042499   60.0
155 -0.027310  0.050680  0.060618  ...  0.037814  0.048628  186.0
..        ...       ...       ...  ...       ...       ...    ...
63  -0.034575 -0.044642 -0.037463  ... -0.030751 -0.071494  128.0
326  0.045341  0.050680 -0.008362  ...  0.029936  0.027917  131.0
337  0.019913  0.050680 -0.012673  ...  0.005384  0.003064   91.0
11   0.027178  0.050680  0.017506  ... -0.096433 -0.059067   69.0
351 -0.085430  0.050680 -0.040696  ... -0.057800 -0.042499   71.0

[442 rows x 11 columns]

In [ ]:
X = df.drop("label", axis=1)
y = df["label"]

In [ ]:
# split data to testing and training dataset
from sklearn.model_selection import  train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)
X_train.shape, y_train.shape, X_test.shape, y_test.shape

((353, 10), (353,), (89, 10), (89,))

In [ ]:
# import regression model
from sklearn.linear_model import LinearRegression
# create an object
linreg = LinearRegression()

In [ ]:
# train the model
linreg.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [ ]:
# Making prediction using testing set
test_pred = linreg.predict(X_test)
test_pred

array([139.5483133 , 179.52030578, 134.04133298, 291.41193598,
       123.78723656,  92.17357677, 258.23409704, 181.33895238,
        90.22217862, 108.63143298,  94.13938654, 168.43379636,
        53.50669663, 206.63040068, 100.13238561, 130.66881649,
       219.53270758, 250.78291772, 196.36682356, 218.57497401,
       207.35002447,  88.48361667,  70.43428801, 188.95725301,
       154.88720039, 159.35957695, 188.31587948, 180.38835506,
        47.98988446, 108.97514644, 174.78080029,  86.36598906,
       132.95890535, 184.5410226 , 173.83298051, 190.35863287,
       124.41740796, 119.65426903, 147.95402494,  59.05311211,
        71.62636914, 107.68722902, 165.45544477, 155.00784964,
       171.04558668,  61.45763075,  71.66975626, 114.96330486,
        51.57808027, 167.57781958, 152.52505798,  62.95827693,
       103.49862017, 109.20495627, 175.63844013, 154.60247734,
        94.41476124, 210.74244148, 120.25601864,  77.61590087,
       187.93503183, 206.49543321, 140.63018684, 105.59463059,
       130.704246  , 202.18650868, 171.1330116 , 164.91246096,
       124.72637597, 144.81210187, 181.99631481, 199.41234515,
       234.21402489, 145.96053305,  79.86349114, 157.36828831,
       192.74737754, 208.8980067 , 158.58505486, 206.0226849 ,
       107.47978402, 140.93428553,  54.81856678,  55.92807758,
       115.00974554,  78.95886675,  81.55731377,  54.3774778 ,
       166.25477778])